[{
  "id": 1,
  "user": {
    "login": "hakant",
    "id": 1907367,
    "avatar_url": "https://avatars.githubusercontent.com/u/1907367?v=3",
    "name": "Hakan Tuncer"
  },
  "title": "Hackathon Planner",
  "overview": "Create a fun & useful environment where hackathon ideas can live and team formation around those ideas",
  "description": "\n#Virtual Networks Research\n\n---\n### The following notes in this section are based on this video: \n\nhttps://channel9.msdn.com/events/Ignite/2015/BRK1454\n\n* 32:22 -- Site to site is safe. Standard protocols and standard [IPSec](https://en.wikipedia.org/wiki/IPsec). But it's not predictable because it relies on the internet.\n\n* 32:36 -- shows the site to site VPN and Express Route. Site to site VPN uses the public internet between the VPN devices while ExpressRoute is using a private WAN and bypasses the internet. But both need a site to site Virtual Network (2 VPN devices talking to each other) (But apparently there are 2 more ways of setting up ExpressRoute).\n\n* 39:50 -- IPSec is crypto heavy. Every package going through an IPSec tunnel is encrypted. Puts burden on participants. Starts impacting performance and bandwidth (expect no more than 80 to 100 Mbits). There is latency and it's not predictable due to traversing (the internet). That's why you may want to have ExpressRoute. Putting MS into your WAN. MS is like your branch office.\n\n* 44:48 -- Express Route Providers:\n  * Exchange Provider\n  * Network Service Provider\n\n* 48:54 -- Express Route Premium Add On\n  * Global connectivity. Virtual Networks from any regions can be linked to your ExpressRoute circuit\n  * More virtual networks and more routes (IP Prefixes)\n\n* Express Route and Site to site VPN can co-exist together now (since May 2015).\n\n* 54:27 -- Table for pricing and metrics.\n\n---\n\n##[ExpressRoute technical overview](https://azure.microsoft.com/en-us/documentation/articles/expressroute-introduction/) (recommended, good overview - features, bandwidth options, billing models etc.)\n\n### How can I connect my network to Microsoft using ExpressRoute?\n\nYou can create a connection between your on-premises network and the Microsoft cloud in three different ways:\n\n>@hakant: Does 1 and 2 require anything from us, or in other words require any change in the way Nfield is deployed (Virtual Networks, VPN's etc.)?\n\n1. __Co-located at a cloud exchange.__ If you are co-located in a facility with a cloud exchange, you can order virtual cross-connections to the Microsoft cloud through the co-location provider’s Ethernet exchange. Co-location providers can offer either Layer 2 cross-connections, or managed Layer 3 cross-connections between your infrastructure in the co-location facility and the Microsoft cloud.\n\n2. __Point-to-point Ethernet connections.__ You can connect your on-premises datacenters/offices to the Microsoft cloud through point-to-point Ethernet links. Point-to-point Ethernet providers can offer Layer 2 connections, or managed Layer 3 connections between your site and the Microsoft cloud.\n\n3. __Any-to-any (IPVPN) networks.__ You can integrate your WAN with the Microsoft cloud. IPVPN providers (typically MPLS VPN) offer any-to-any connectivity between your branch offices and datacenters. The Microsoft cloud can be interconnected to your WAN to make it look just like any other branch office. WAN providers typically offer managed Layer 3 connectivity.\n\nExpressRoute capabilities and features are all identical across all of the above connectivity models. Connectivity providers can offer one or more connectivity models from the above list. You can work with your connectivity provider to pick the model that works best for you.\n\n---\n\n## [ExpressRoute FAQ](https://azure.microsoft.com/en-us/documentation/articles/expressroute-faqs/)\n\n* There's interesting stuff here but doesn't tell if ExpressRoute can be used without the necessity of a Virtual Network on Azure side.\n\n---\n\n## Questions\n\n* Can we access an on-premise resource (f.ex a SQL database) from Azure via ExpressRoute without the necessity of adding all our services (cloud services and app services) into a Virtual Network on Azure? I've just asked this question on [ServerFault](https://serverfault.com/questions/748190/azure-expressroute-without-a-virtual-network)\n\nIf the answer to the first question is NO, then it's natural to ask the second question:\n\n* What does it take to put all our cloud services (and one web app) into a Virtual Network and a Site to site VPN? How do we maintain it from deployment to deployment? Would moving to web apps with ARM help us there? (I've read somewhere that ARM Virtual Networks do not support Express Route yet).",
  "labels": ["hackathon", "aurelia", "node.js"],
  "like-count": 30,
  "team-count": 5,
  "liked": true,
  "joined": false
}]
